stm32-hotspot/STM32WBA-BLE-ANCS-AMS/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_ANCS_AMS_HeartRate/STM32_WPAN/App/gatt_client_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    gatt_client_app.c
  * @author  MCD Application Team
  * @brief   GATT Client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "gatt_client_app.h"
#include "stm32_seq.h"
#include "app_ble.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32_timer.h"
#include "ams_app.h"
#include "ancs_app.h"
#include "hrs_app.h"
#include "stm32_lcd.h"
#include "stm32wba55g_discovery.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

typedef enum
{
  NOTIFICATION_INFO_RECEIVED_EVT,
  /* USER CODE BEGIN GATT_CLIENT_APP_Opcode_t */

  /* USER CODE END GATT_CLIENT_APP_Opcode_t */
}GATT_CLIENT_APP_Opcode_t;

typedef struct
{
  uint8_t *p_Payload;
  uint8_t length;
}GATT_CLIENT_APP_Data_t;

typedef struct
{
  GATT_CLIENT_APP_Opcode_t Client_Evt_Opcode;
  GATT_CLIENT_APP_Data_t   DataTransfered;
}GATT_CLIENT_APP_Notification_evt_t;

typedef struct
{
  GATT_CLIENT_APP_State_t state;

  APP_BLE_ConnStatus_t connStatus;
  uint16_t connHdl;

  uint16_t ALLServiceStartHdl;
  uint16_t ALLServiceEndHdl;

  uint16_t GAPServiceStartHdl;
  uint16_t GAPServiceEndHdl;

  uint16_t GATTServiceStartHdl;
  uint16_t GATTServiceEndHdl;

  uint16_t ServiceChangedCharStartHdl;
  uint16_t ServiceChangedCharValueHdl;
  uint16_t ServiceChangedCharDescHdl;
  uint16_t ServiceChangedCharEndHdl;
  uint8_t ServiceChangedCharProperties;

  /* USER CODE BEGIN BleClientAppContext_t */
  /* handles of the AMS service and char */
  uint16_t AMSServiceStartHandle;
  uint16_t AMSServiceEndHandle;
  
  uint16_t AMSRemoteCommandCharStartHdle;
  uint16_t AMSRemoteCommandCharValueHdle;
  uint16_t AMSRemoteCommandCharDescHdle;
  
  uint16_t AMSEntityUpdateCharStartHdle;
  uint16_t AMSEntityUpdateCharValueHdle;
  uint16_t AMSEntityUpdateCharDescHdle;  
  
  uint16_t AMSEntityAttributeCharStartHdle;
  uint16_t AMSEntityAttributeCharValueHdle;
  /* end of handles of the AMS service and char */

  /* handles of the ANCS service and char */
  uint16_t ANCSServiceStartHandle;
  uint16_t ANCSServiceEndHandle;
  
  uint16_t ANCSNotifSourceCharStartHdle;
  uint16_t ANCSNotifSourceCharValueHdle;
  uint16_t ANCSNotifSourceCharDescHdle;
  
  uint16_t ANCSCtrlPointCharStartHdle;
  uint16_t ANCSCtrlPointCharValueHdle; 
  
  uint16_t ANCSDataSourceCharStartHdle;
  uint16_t ANCSDataSourceCharValueHdle;
  uint16_t ANCSDataSourceCharDescHdle;
  /* end of handles of the ANCS service and char */
  
  /* handles of the Battery service and char */
  uint16_t BatteryServiceStartHandle;
  uint16_t BatteryServiceEndHandle;
  
  uint16_t BatteryLevelCharStartHdle;
  uint16_t BatteryLevelCharValueHdle;
  uint16_t BatteryLevelCharDescHdle;
  /* end of handles of the Battery service and char */
  
  /* handles of the Current Time service and char */
  uint16_t CurrentTimeServiceStartHandle;
  uint16_t CurrentTimeServiceEndHandle;
  
  uint16_t CurrentTimeCharStartHdle;
  uint16_t CurrentTimeCharValueHdle;

  /* end of handles of the Battery service and char */  
/* USER CODE END BleClientAppContext_t */

}BleClientAppContext_t;

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define REFRESH_SCREEN_TIMER 500
/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

static BleClientAppContext_t a_ClientContext[BLE_CFG_CLT_MAX_NBR_CB];
static uint16_t gattCharStartHdl = 0;
static uint16_t gattCharValueHdl = 0;

/* USER CODE BEGIN PV */
static UTIL_TIMER_Object_t ClientTimer_Id;
static UTIL_TIMER_Object_t Start_Notification_Id;
static Init_Client_State_t init_state;
static uint8_t counter_to_1_min = 0;
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
/* USER CODE BEGIN GV */
extern gatt_client_interface_ams_t gatt_client_interface_ams;
extern gatt_client_interface_ancs_t gatt_client_interface_ancs;

extern AMS_init_data_t AMS_init_data;
extern ANCS_init_data_t ANCS_init_data;

uint8_t current_battery_level = 0;
uint8_t current_time_hour = 0;
uint8_t current_time_min = 0;
/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event);
static void gatt_parse_services(aci_att_read_by_group_type_resp_event_rp0 *p_evt);
static void gatt_parse_services_by_UUID(aci_att_find_by_type_value_resp_event_rp0 *p_evt);
static void gatt_parse_chars(aci_att_read_by_type_resp_event_rp0 *p_evt);
static void gatt_parse_descs(aci_att_find_info_resp_event_rp0 *p_evt);
static void gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt);
static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif);
static void client_discover_all(void);
static void gatt_cmd_resp_release(void);
static void gatt_cmd_resp_wait(void);
/* USER CODE BEGIN PFP */

