stm32-hotspot/STM32WBA-BLE-ANCS-AMS/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_ANCS_AMS_HeartRate/STM32_WPAN/App/gatt_client_app.c
static void send_cmd_to_ams(GattCmdToAMS_t GattCmdToAMS, uint16_t char_UUID, uint8_t l_payload, uint8_t *p_Payload);
static void send_cmd_to_ancs(GattCmdToANCS_t GattCmdToANCS, uint16_t char_UUID, uint8_t l_payload, uint8_t *p_Payload);

static void ClientTimer_cb(void *arg);
static void ClientTimer_Task(void);

static void start_notification(void *arg);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void GATT_CLIENT_APP_Init(void)
{
  uint8_t index =0;
  /* USER CODE BEGIN GATT_CLIENT_APP_Init_1 */
  AMS_APP_Init();
  AMS_init_data.connHdl = (uint16_t *) &(a_ClientContext[index].connHdl);
  AMS_init_data.EntityAttributeCharValueHdle = (uint16_t *) &(a_ClientContext[index].AMSEntityAttributeCharValueHdle);
  AMS_init_data.RemoteCommandCharValueHdle   = (uint16_t *) &(a_ClientContext[index].AMSRemoteCommandCharValueHdle);
  AMS_init_data.EntityUpdateCharValueHdle    = (uint16_t *) &(a_ClientContext[index].AMSEntityUpdateCharValueHdle);
  
  ANCS_APP_Init();
  ANCS_init_data.app_init = false;
  ANCS_init_data.connHdl = (uint16_t *) &(a_ClientContext[index].connHdl);
  ANCS_init_data.CtrlPointCharValueHdle =  (uint16_t *) &(a_ClientContext[index].ANCSCtrlPointCharValueHdle);
  ANCS_init_data.DataSourceCharValueHdle = (uint16_t *) &(a_ClientContext[index].ANCSDataSourceCharValueHdle);
  ANCS_init_data.NotifSourceCharValueHdle = (uint16_t *) &(a_ClientContext[index].ANCSNotifSourceCharValueHdle);
  /* USER CODE END GATT_CLIENT_APP_Init_1 */
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    a_ClientContext[index].connStatus = APP_BLE_IDLE;
  }

  /* Register the event handler to the BLE controller */
  SVCCTL_RegisterCltHandler(Event_Handler);

  /* Register a task allowing to discover all services and characteristics and enable all notifications */
  UTIL_SEQ_RegTask(1U << CFG_TASK_DISCOVER_SERVICES_ID, UTIL_SEQ_RFU, client_discover_all);

  /* USER CODE BEGIN GATT_CLIENT_APP_Init_2 */
  UTIL_TIMER_Create(&ClientTimer_Id,
                    REFRESH_SCREEN_TIMER,
                    UTIL_TIMER_PERIODIC,
                    &ClientTimer_cb, 0);
  
  UTIL_TIMER_Create(&Start_Notification_Id,
                    200,
                    UTIL_TIMER_ONESHOT,
                    &start_notification, 0);  
  
  UTIL_SEQ_RegTask(1U << CFG_TASK_CLIENT_TIMER_ID, UTIL_SEQ_RFU, ClientTimer_Task);
  /* USER CODE END GATT_CLIENT_APP_Init_2 */
  return;
}

void GATT_CLIENT_APP_Notification(GATT_CLIENT_APP_ConnHandle_Notif_evt_t *p_Notif)
{
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_1 */

  /* USER CODE END GATT_CLIENT_APP_Notification_1 */
  switch(p_Notif->ConnOpcode)
  {
    /* USER CODE BEGIN ConnOpcode */

    /* USER CODE END ConnOpcode */

    case PEER_CONN_HANDLE_EVT :
      /* USER CODE BEGIN PEER_CONN_HANDLE_EVT */
      for(uint8_t index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;
        a_ClientContext[index].connStatus = APP_BLE_CONNECTED_CLIENT;
      }
      /* USER CODE END PEER_CONN_HANDLE_EVT */
      break;

    case PEER_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN PEER_DISCON_HANDLE_EVT */
      for(uint8_t index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_IDLE;
        a_ClientContext[index].connStatus = APP_BLE_IDLE;
      }
      UTIL_TIMER_Stop(&ClientTimer_Id);
      current_battery_level = 0;
      send_cmd_to_ancs(ANCS_DECONNECTION, NULL, NULL, NULL);
      send_cmd_to_ams(AMS_DECONNECTION, NULL, NULL, NULL);
      /* USER CODE END PEER_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN ConnOpcode_Default */

      /* USER CODE END ConnOpcode_Default */
      break;
  }
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_2 */

  /* USER CODE END GATT_CLIENT_APP_Notification_2 */
  return;
}

uint8_t GATT_CLIENT_APP_Set_Conn_Handle(uint8_t index, uint16_t connHdl)
{
  uint8_t ret;

  if (index < BLE_CFG_CLT_MAX_NBR_CB)
  {
    a_ClientContext[index].connHdl = connHdl;
    ret = 0;
  }
  else
  {
    ret = 1;
  }

  return ret;
}

uint8_t GATT_CLIENT_APP_Get_State(uint8_t index)
{
  return a_ClientContext[index].state;
}

void GATT_CLIENT_APP_Discover_services(uint8_t index)
{
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_DISC_ALL_PRIMARY_SERVICES);
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_DISC_ALL_CHARS);
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_DISC_ALL_DESCS);
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_PROPERTIES_ENABLE_ALL);

  return;
}

uint8_t GATT_CLIENT_APP_Procedure_Gatt(uint8_t index, ProcGattId_t GattProcId)
{
  tBleStatus result = BLE_STATUS_SUCCESS;
  uint8_t status;

  if (index >= BLE_CFG_CLT_MAX_NBR_CB)
  {
    status = 1;
  }
  else
  {
    status = 0;
    switch (GattProcId)
    {
      case PROC_GATT_DISC_ALL_PRIMARY_SERVICES:
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_SERVICES;

        LOG_INFO_APP("GATT services discovery\n");
        result = aci_gatt_disc_all_primary_services(a_ClientContext[index].connHdl);

        if (result == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
          LOG_INFO_APP("PROC_GATT_DISC_ALL_PRIMARY_SERVICES services discovered Successfully\n\n");
        }
        else
        {
          LOG_INFO_APP("PROC_GATT_DISC_ALL_PRIMARY_SERVICES aci_gatt_disc_all_primary_services cmd NOK status =0x%02X\n\n", result);
        }
      }
      break; /* PROC_GATT_DISC_ALL_PRIMARY_SERVICES */

      case PROC_GATT_DISC_ALL_CHARS:
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_CHARACS;

        LOG_INFO_APP("DISCOVER_ALL_CHARS ConnHdl=0x%04X ALLServiceHandle[0x%04X - 0x%04X]\n",
                          a_ClientContext[index].connHdl,
                          a_ClientContext[index].ALLServiceStartHdl,
                          a_ClientContext[index].ALLServiceEndHdl);

        result = aci_gatt_disc_all_char_of_service(
                           a_ClientContext[index].connHdl,
                           a_ClientContext[index].ALLServiceStartHdl,
                           a_ClientContext[index].ALLServiceEndHdl);

        if (result == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
          LOG_INFO_APP("All characteristics discovered Successfully\n\n");
        }
        else
        {
          LOG_INFO_APP("All characteristics discovery Failed, status =0x%02X\n\n", result);
        }
      }
      break; /* PROC_GATT_DISC_ALL_CHARS */

      case PROC_GATT_DISC_ALL_DESCS:
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_WRITE_DESC;

        LOG_INFO_APP("DISCOVER_ALL_CHAR_DESCS [0x%04X - 0x%04X]\n",
                         a_ClientContext[index].ALLServiceStartHdl,
                         a_ClientContext[index].ALLServiceEndHdl);
        result = aci_gatt_disc_all_char_desc(
                         a_ClientContext[index].connHdl,
                         a_ClientContext[index].ALLServiceStartHdl,
                         a_ClientContext[index].ALLServiceEndHdl);

        if (result == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
          LOG_INFO_APP("All characteristic descriptors discovered Successfully\n\n");
        }
        else
        {
          LOG_INFO_APP("All characteristic descriptors discovery Failed, status =0x%02X\n\n", result);
        }
      }
      break; /* PROC_GATT_DISC_ALL_DESCS */
      case PROC_GATT_PROPERTIES_ENABLE_ALL:
      {
        uint16_t charPropVal = 0x0000;

