stm32-hotspot/STM32WBA-BLE-ANCS-AMS/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_ANCS_AMS_HeartRate/STM32_WPAN/App/gatt_client_app.c
        if (a_ClientContext[index].ServiceChangedCharDescHdl != 0x0000)
        {
          if(((a_ClientContext[index].ServiceChangedCharProperties) & CHAR_PROP_NOTIFY) == CHAR_PROP_NOTIFY)
          {
            charPropVal = 0x0001;
          }
          if(((a_ClientContext[index].ServiceChangedCharProperties) & CHAR_PROP_INDICATE) == CHAR_PROP_INDICATE)
          {
            charPropVal = 0x0002;
          }
          result = aci_gatt_write_char_desc(a_ClientContext[index].connHdl,
                                            a_ClientContext[index].ServiceChangedCharDescHdl,
                                            2,
                                            (uint8_t *) &charPropVal);
          gatt_cmd_resp_wait();
          LOG_INFO_APP(" ServiceChangedCharDescHdl =0x%04X\n",a_ClientContext[index].ServiceChangedCharDescHdl);
        }
        /* USER CODE BEGIN PROC_GATT_PROPERTIES_ENABLE_ALL */
        uint8_t enable = 0x01;

        if(a_ClientContext[index].AMSEntityUpdateCharDescHdle != 0x0000)
        {
          result = aci_gatt_write_char_desc(a_ClientContext[index].connHdl,
                                            a_ClientContext[index].AMSEntityUpdateCharDescHdle,
                                            2,
                                            (uint8_t *) &enable);
          if (result == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  AMS Entity Update notification enabled Successfully\n");
            gatt_cmd_resp_wait();  
          }
          else
          {
            LOG_INFO_APP("  AMS Entity Update notification enabled Failed result=0x%02X\n",result);
          }  
        }
        
        if(a_ClientContext[index].AMSRemoteCommandCharDescHdle != 0x0000)
        {
          result = aci_gatt_write_char_desc(a_ClientContext[index].connHdl,
                                            a_ClientContext[index].AMSRemoteCommandCharDescHdle,
                                            2,
                                            (uint8_t *) &enable);
          if (result == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  AMS Remote Command notification enabled Successfully\n");
            gatt_cmd_resp_wait();          
          }
          else
          {
            LOG_INFO_APP("  AMS Remote Command notification enabled Failed result=0x%02X\n",result);
          }          
        }
        
        if(a_ClientContext[index].BatteryLevelCharDescHdle != 0x0000)
        {
          result = aci_gatt_write_char_desc(a_ClientContext[index].connHdl,
                                            a_ClientContext[index].BatteryLevelCharDescHdle,
                                            2,
                                            (uint8_t *) &enable);
          if (result == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Battery Level notification enabled Successfully \n\r");
            gatt_cmd_resp_wait();          
          }
          else
          {
            LOG_INFO_APP("  Battery Level notification enabled Failed result=0x%02X\n",result);
          }          
        }

        if(a_ClientContext[index].ANCSDataSourceCharDescHdle!= 0x0000)
        {
          result = aci_gatt_write_char_desc(a_ClientContext[index].connHdl,
                                            a_ClientContext[index].ANCSDataSourceCharDescHdle,
                                            2,
                                            (uint8_t *) &enable);
          if (result == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  ANCS Data Source notification enabled Successfully\n");
            gatt_cmd_resp_wait();          
          }
          else
          {
            LOG_INFO_APP("  ANCS Data Source notification enabled Failed result=0x%02X\n",result);
          }          
        }
        
        if(a_ClientContext[index].ANCSNotifSourceCharDescHdle!= 0x0000)
        {
          result = aci_gatt_write_char_desc(a_ClientContext[index].connHdl,
                                            a_ClientContext[index].ANCSNotifSourceCharDescHdle,
                                            2,
                                            (uint8_t *) &enable);
          if (result == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  ANCS Notif Source notification enabled Successfully\n");
            gatt_cmd_resp_wait();  
          }
          else
          {
            LOG_INFO_APP("  ANCS Notif Source notification enabled Failed result=0x%02X\n",result);
          }          
        }        
        /* USER CODE END PROC_GATT_PROPERTIES_ENABLE_ALL */

        if (result == BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("All notifications enabled Successfully\n\n");
        }
        else
        {
          LOG_INFO_APP("All notifications enabled Failed, status =0x%02X\n\n", result);
        }
      }
      break; /* PROC_GATT_PROPERTIES_ENABLE_ALL */
    default:
      break;
    }
  }

  return status;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event)
{
  SVCCTL_EvtAckStatus_t return_value;
  hci_event_pckt *event_pckt;
  evt_blecore_aci *p_blecore_evt;

  GATT_CLIENT_APP_Notification_evt_t Notification;
  UNUSED(Notification);

  return_value = SVCCTL_EvtNotAck;
  event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)Event)->data);

  switch (event_pckt->evt)
  {
    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*)event_pckt->data;
      switch (p_blecore_evt->ecode)
      {
        case ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
        {
          aci_att_read_by_group_type_resp_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;
          gatt_parse_services((aci_att_read_by_group_type_resp_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE */
        case ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE:
        {
          aci_att_find_by_type_value_resp_event_rp0 *p_evt_rsp = (void*) p_blecore_evt->data;
          gatt_parse_services_by_UUID((aci_att_find_by_type_value_resp_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE */
        case ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE:
        {
          aci_att_read_by_type_resp_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;
          gatt_parse_chars((aci_att_read_by_type_resp_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE */
        case ACI_ATT_FIND_INFO_RESP_VSEVT_CODE:
        {
          aci_att_find_info_resp_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;
          gatt_parse_descs((aci_att_find_info_resp_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_ATT_FIND_INFO_RESP_VSEVT_CODE */
        case ACI_GATT_NOTIFICATION_VSEVT_CODE:
        {
          aci_gatt_notification_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;
          gatt_parse_notification((aci_gatt_notification_event_rp0 *)p_evt_rsp);
        }
        break;/* ACI_GATT_NOTIFICATION_VSEVT_CODE */
        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gatt_proc_complete_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;

