stm32-hotspot/STM32WBA-BLE-ANCS-AMS/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_ANCS_AMS_HeartRate/STM32_WPAN/App/gatt_client_app.c
        LOG_INFO_APP(", AMS_SERVICE_UUID found\n");
      }
      else if (uuid == ANCS_SERVICE_UUID)
      {
        a_ClientContext[index].ANCSServiceStartHandle = ServiceStartHdl;
        a_ClientContext[index].ANCSServiceEndHandle = ServiceEndHdl;

        LOG_INFO_APP(", ANCS_SERVICE_UUID found\n");
      }
      else if (uuid == BATTERY_SERVICE_UUID)
      {
        a_ClientContext[index].BatteryServiceStartHandle = ServiceStartHdl;
        a_ClientContext[index].BatteryServiceEndHandle = ServiceEndHdl;

        LOG_INFO_APP(", BATTERY_SERVICE_UUID found\n");
      }
/* USER CODE END gatt_parse_services_1 */
      else
      {
        LOG_INFO_APP("\n");
      }

      uuid_offset += p_evt->Attribute_Data_Length;
    }
  }
  else
  {
    LOG_INFO_APP("ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE, failed no free index in connection table !\n");
  }

  return;
}

/**
* function of GATT service parse by UUID
*/
static void gatt_parse_services_by_UUID(aci_att_find_by_type_value_resp_event_rp0 *p_evt)
{
  uint8_t i;

//  LOG_INFO_APP("ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE - ConnHdl=0x%04X, Num_of_Handle_Pair=%d\n",
//                p_evt->Connection_Handle,
//                p_evt->Num_of_Handle_Pair);

  for(i = 0 ; i < p_evt->Num_of_Handle_Pair ; i++)
  {
    LOG_INFO_APP("ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE - PaitId=%d Found_Attribute_Handle=0x%04X, Group_End_Handle=0x%04X\n",
                  i,
                  p_evt->Attribute_Group_Handle_Pair[i].Found_Attribute_Handle,
                  p_evt->Attribute_Group_Handle_Pair[i].Group_End_Handle);
  }

/* USER CODE BEGIN gatt_parse_services_by_UUID_1 */

/* USER CODE END gatt_parse_services_by_UUID_1 */

  return;
}

/**
* function of GATT characteristics parse
*/
static void gatt_parse_chars(aci_att_read_by_type_resp_event_rp0 *p_evt)
{
  uint16_t uuid, CharStartHdl, CharValueHdl;
  uint8_t uuid_offset, uuid_size = 0U, uuid_short_offset = 0U;
  uint8_t i, idx, numHdlValuePair, index;
  uint8_t CharProperties;

//  LOG_INFO_APP("ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE - ConnHdl=0x%04X\n",
//                p_evt->Connection_Handle);

  for (index = 0 ; index < BLE_CFG_CLT_MAX_NBR_CB ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  /* index < BLE_CFG_CLT_MAX_NBR_CB means connection handle identified */
  if (index < BLE_CFG_CLT_MAX_NBR_CB)
  {
    /* event data in Attribute_Data_List contains:
    * 2 bytes for start handle
    * 1 byte char properties
    * 2 bytes handle
    * 2 or 16 bytes data for UUID
    */

    /* Number of attribute value tuples */
    numHdlValuePair = p_evt->Data_Length / p_evt->Handle_Value_Pair_Length;

    uuid_offset = 5;           /* UUID offset in bytes in Attribute_Data_List */
    if (p_evt->Handle_Value_Pair_Length == 21) /* we are interested in  128 bit UUIDs */
    {
      idx = 17;                /* UUID index of 2 bytes read part in Attribute_Data_List */
      uuid_size = 16;          /* UUID size in bytes */
      uuid_short_offset = 12;  /* UUID offset of 2 bytes read part in UUID field */
    }
    if (p_evt->Handle_Value_Pair_Length == 7) /* we are interested in  16 bit UUIDs */
    {
      idx = 5;
      uuid_size = 2;
      uuid_short_offset = 0;
    }
    UNUSED(idx);
    UNUSED(uuid_size);

    p_evt->Data_Length -= 1;

    LOG_INFO_APP("  ConnHdl=0x%04X, number of value pair = %d\n", a_ClientContext[index].connHdl, numHdlValuePair);
    /* Loop on number of attribute value tuples */
    for (i = 0; i < numHdlValuePair; i++)
    {
      CharStartHdl = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_Value_Pair_Data[uuid_offset - 5]);
      CharProperties = p_evt->Handle_Value_Pair_Data[uuid_offset - 3];
      CharValueHdl = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_Value_Pair_Data[uuid_offset - 2]);
      uuid = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_Value_Pair_Data[uuid_offset + uuid_short_offset]);

      if ( (uuid != 0x0) && (CharProperties != 0x0) && (CharStartHdl != 0x0) && (CharValueHdl != 0) )
      {
        LOG_INFO_APP("    %d/%d short UUID=0x%04X, Properties=0x%04X, CharHandle [0x%04X - 0x%04X]",
                     i + 1, numHdlValuePair, uuid, CharProperties, CharStartHdl, CharValueHdl);

        if (uuid == DEVICE_NAME_UUID)
        {
          LOG_INFO_APP(", GAP DEVICE_NAME charac found\n");
        }
        else if (uuid == APPEARANCE_UUID)
        {
          LOG_INFO_APP(", GAP APPEARANCE charac found\n");
        }
        else if (uuid == SERVICE_CHANGED_CHARACTERISTIC_UUID)
        {
          a_ClientContext[index].ServiceChangedCharStartHdl = CharStartHdl;
          a_ClientContext[index].ServiceChangedCharValueHdl = CharValueHdl;
          LOG_INFO_APP(", GATT SERVICE_CHANGED_CHARACTERISTIC_UUID charac found\n");
        }
/* USER CODE BEGIN gatt_parse_chars_1 */
        else if (uuid == MANUFACTURER_NAME_UUID)
        {
          //Not Used
          LOG_INFO_APP(", MANUFACTURER_NAME_UUID charac found\n");
        }
        else if (uuid == MODEL_NUMBER_UUID)
        {
          //Not Used
          LOG_INFO_APP(", MODEL_NUMBER_UUID charac found\n");
        }
        else if (uuid == BATTERY_LEVEL_CHAR_UUID)
        {
          a_ClientContext[index].BatteryLevelCharStartHdle = CharStartHdl;
          a_ClientContext[index].BatteryLevelCharValueHdle = CharValueHdl;
          LOG_INFO_APP(", BATTERY_LEVEL_CHAR_UUID charac found\n");
        }
        else if (uuid == CURRENT_TIME_CHAR_UUID)
        {
          a_ClientContext[index].CurrentTimeCharStartHdle = CharStartHdl;
          a_ClientContext[index].CurrentTimeCharValueHdle = CharValueHdl;
          LOG_INFO_APP(", CURRENT_TIME_CHAR_UUID charac found\n");
        }
        else if (uuid == LOCAL_TIME_INFORMATION_CHAR_UUID)
        {
          //Not Used
          LOG_INFO_APP(", LOCAL_TIME_INFORMATION_CHAR_UUID charac found\n");
        }
        else if (uuid == AMS_REMOTE_COMMAND_CHAR_UUID)
        {
          a_ClientContext[index].AMSRemoteCommandCharStartHdle = CharStartHdl;
          a_ClientContext[index].AMSRemoteCommandCharValueHdle = CharValueHdl;
          LOG_INFO_APP(", AMS_REMOTE_COMMAND_CHAR_UUID charac found\n");
        }
        else if (uuid == AMS_ENTITY_UPDATE_CHAR_UUID)
        {
          a_ClientContext[index].AMSEntityUpdateCharStartHdle = CharStartHdl;
          a_ClientContext[index].AMSEntityUpdateCharValueHdle = CharValueHdl;
          LOG_INFO_APP(", AMS_ENTITY_UPDATE_CHAR_UUID charac found\n");
        }
        else if (uuid == AMS_ENTITY_ATTRIBUTE_CHAR_UUID)
        {
          a_ClientContext[index].AMSEntityAttributeCharStartHdle = CharStartHdl;
          a_ClientContext[index].AMSEntityAttributeCharValueHdle = CharValueHdl;
          LOG_INFO_APP(", AMS_ENTITY_ATTRIBUTE_CHAR_UUID charac found\n");
        }
        
        else if (uuid == ANCS_NOTIFICATION_SOURCE_CHAR_UUID)
        {
          a_ClientContext[index].ANCSNotifSourceCharStartHdle = CharStartHdl;
          a_ClientContext[index].ANCSNotifSourceCharValueHdle = CharValueHdl;
          LOG_INFO_APP(", ANCS_NOTIFICATION_SOURCE_CHAR_UUID charac found\n");
        }
        else if (uuid == ANCS_DATA_SOURCE_CHAR_UUID)
        {
          a_ClientContext[index].ANCSDataSourceCharStartHdle = CharStartHdl;
          a_ClientContext[index].ANCSDataSourceCharValueHdle = CharValueHdl;
          LOG_INFO_APP(", ANCS_DATA_SOURCE_CHAR_UUID charac found\n");
        }
        else if (uuid == ANCS_CONTROL_POINT_CHAR_UUID)
        {
          a_ClientContext[index].ANCSCtrlPointCharStartHdle = CharStartHdl;
          a_ClientContext[index].ANCSCtrlPointCharValueHdle = CharValueHdl;
          LOG_INFO_APP(", ANCS_CONTROL_POINT_CHAR_UUID charac found\n");
        }
/* USER CODE END gatt_parse_chars_1 */
        else
        {
          LOG_INFO_APP("\n");
        }

