stm32-hotspot/STM32WBA-BLE-ANCS-AMS/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_ANCS_AMS_HeartRate/STM32_WPAN/App/gatt_client_app.c
      }
      uuid_offset += p_evt->Handle_Value_Pair_Length;
    }
  }
  else
  {
    LOG_INFO_APP("ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
  }

  return;
}
/**
* function of GATT descriptor parse
*/
static void gatt_parse_descs(aci_att_find_info_resp_event_rp0 *p_evt)
{
  uint16_t uuid, handle;
  uint8_t uuid_offset, uuid_size, uuid_short_offset, handle_uuid_pair_size;
  uint8_t i, numDesc, index;

//  LOG_INFO_APP("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE - ConnHdl=0x%04X\n",
//              p_evt->Connection_Handle);

  for (index = 0 ; index < BLE_CFG_CLT_MAX_NBR_CB ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  /* index < BLE_CFG_CLT_MAX_NBR_CB means connection handle identified */
  if (index < BLE_CFG_CLT_MAX_NBR_CB)
  {
    /* event data in Attribute_Data_List contains:
    * 2 bytes handle
    * 2 or 16 bytes data for UUID
    */
    uuid_offset = 2;
    if (p_evt->Format == UUID_TYPE_16)
    {
      uuid_size = 2;
      uuid_short_offset = 0;
      handle_uuid_pair_size = 4;
    }
    else if (p_evt->Format == UUID_TYPE_128)
    {
      uuid_size = 16;
      uuid_short_offset = 12;
      handle_uuid_pair_size = 18;
    }
    else
    {
      return;
    }
    UNUSED(uuid_size);

    /* Number of handle uuid pairs */
    numDesc = (p_evt->Event_Data_Length) / handle_uuid_pair_size;

    for (i = 0; i < numDesc; i++)
    {
      handle = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_UUID_Pair[uuid_offset - 2]);
      uuid = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_UUID_Pair[uuid_offset + uuid_short_offset]);

      if (uuid == PRIMARY_SERVICE_UUID)
      {
//        LOG_INFO_APP("PRIMARY_SERVICE_UUID=0x%04X handle=0x%04X\n", uuid, handle);
      }
      else if (uuid == CHARACTERISTIC_UUID)
      {
        /* reset UUID & handle */
        gattCharStartHdl = 0;
        gattCharValueHdl = 0;

        gattCharStartHdl = handle;
//        LOG_INFO_APP("reset - UUID & handle - CHARACTERISTIC_UUID=0x%04X CharStartHandle=0x%04X\n", uuid, handle);
      }
      else if ( (uuid == CHAR_EXTENDED_PROPERTIES_DESCRIPTOR_UUID)
             || (uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID) )
      {

//        LOG_INFO_APP("Descriptor UUID=0x%04X, handle=0x%04X-0x%04X-0x%04X",
//                      uuid,
//                      gattCharStartHdl,
//                      gattCharValueHdl,
//                      handle);
        if (a_ClientContext[index].ServiceChangedCharValueHdl == gattCharValueHdl)
        {
          a_ClientContext[index].ServiceChangedCharDescHdl = handle;
//          LOG_INFO_APP(", Service Changed found\n");
        }
/* USER CODE BEGIN gatt_parse_descs_1 */
        else if (uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID)
        {
          if (a_ClientContext[index].AMSRemoteCommandCharValueHdle == gattCharValueHdl)
          {
            a_ClientContext[index].AMSRemoteCommandCharDescHdle = handle;
            LOG_INFO_APP("  Descriptor found, AMS Remote Cmd char Descriptor found,    handle=0x%04X\n", handle);
          }
          else if (a_ClientContext[index].AMSEntityUpdateCharValueHdle == gattCharValueHdl)
          {
            a_ClientContext[index].AMSEntityUpdateCharDescHdle = handle;
            LOG_INFO_APP("  Descriptor found, AMS Entity Update char Descriptor found, handle=0x%04X\n", handle);
          }        
          else if (a_ClientContext[index].ANCSNotifSourceCharValueHdle == gattCharValueHdl)
          {
            a_ClientContext[index].ANCSNotifSourceCharDescHdle = handle;
            LOG_INFO_APP("  Descriptor found, ANCS Notif Source char Descriptor found, handle=0x%04X\n", handle);
          }
          else if (a_ClientContext[index].ANCSDataSourceCharValueHdle == gattCharValueHdl)
          {
            a_ClientContext[index].ANCSDataSourceCharDescHdle = handle;
            LOG_INFO_APP("  Descriptor found, ANCS Data source char Descriptor found,  handle=0x%04X\n", handle);
          }
          else if (a_ClientContext[index].BatteryLevelCharValueHdle == gattCharValueHdl)
          {
            a_ClientContext[index].BatteryLevelCharDescHdle = handle;
            LOG_INFO_APP("  Descriptor found, Battery level char Descriptor found,  handle=0x%04X\n", handle);
          }
          UNUSED(gattCharStartHdl);
        }
/* USER CODE END gatt_parse_descs_1 */
        else
        {
//          LOG_INFO_APP("\n");
        }
      }
      else
      {
        gattCharValueHdl = handle;

//        LOG_INFO_APP("  UUID=0x%04X, handle=0x%04X", uuid, handle);

        if (uuid == DEVICE_NAME_UUID)
        {
//          LOG_INFO_APP(", found GAP DEVICE_NAME_UUID\n");
        }
        else if (uuid == APPEARANCE_UUID)
        {
//          LOG_INFO_APP(", found GAP APPEARANCE_UUID\n");
        }
        else if (uuid == SERVICE_CHANGED_CHARACTERISTIC_UUID)
        {
//          LOG_INFO_APP(", found GATT SERVICE_CHANGED_CHARACTERISTIC_UUID\n");
        }
/* USER CODE BEGIN gatt_parse_descs_2 */

/* USER CODE END gatt_parse_descs_2 */
        else
        {
//          LOG_INFO_APP("\n");
        }
      }
    uuid_offset += handle_uuid_pair_size;
    }
  }
  else
  {
    LOG_INFO_APP("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
  }

  return;
}

static void gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt)
{
//  LOG_INFO_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
//                p_evt->Connection_Handle,
//                p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */
  uint8_t index;
  for (index = 0 ; index < BLE_CFG_CLT_MAX_NBR_CB ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
  {
    if (p_evt->Attribute_Handle == a_ClientContext[index].ANCSNotifSourceCharValueHdle)
    {
      //LOG_INFO_APP("  Incoming Nofification received ANCS Notif Source\n");
      send_cmd_to_ancs(ANCS_RECEIVE_NOTIF, ANCS_NOTIFICATION_SOURCE_CHAR_UUID, p_evt->Attribute_Value_Length, &p_evt->Attribute_Value[0]);
    }
    else if (p_evt->Attribute_Handle == a_ClientContext[index].ANCSDataSourceCharValueHdle)
    {
      //LOG_INFO_APP("  Incoming Nofification received ANCS Data Source\n");
      send_cmd_to_ancs(ANCS_RECEIVE_NOTIF, ANCS_DATA_SOURCE_CHAR_UUID, p_evt->Attribute_Value_Length, &p_evt->Attribute_Value[0]);      
    }    
    else if (p_evt->Attribute_Handle == a_ClientContext[index].AMSRemoteCommandCharValueHdle)
    {
      //LOG_INFO_APP("  Incoming Nofification received AMS Remote Cmd\n");
      send_cmd_to_ams(AMS_RECEIVE_NOTIF, AMS_REMOTE_COMMAND_CHAR_UUID, p_evt->Attribute_Value_Length, &p_evt->Attribute_Value[0]);
    }
    else if (p_evt->Attribute_Handle == a_ClientContext[index].AMSEntityUpdateCharValueHdle)
    {
      //LOG_INFO_APP("  Incoming Nofification received AMS Entity Updatet Cmd\n");
      send_cmd_to_ams(AMS_RECEIVE_NOTIF, AMS_ENTITY_UPDATE_CHAR_UUID, p_evt->Attribute_Value_Length, &p_evt->Attribute_Value[0]);
    }
    else if (p_evt->Attribute_Handle == a_ClientContext[index].BatteryLevelCharValueHdle)
    {
      //LOG_INFO_APP("  Incoming Nofification received Battery Level :  %d%%\n", p_evt->Attribute_Value[0]);
			current_battery_level = p_evt->Attribute_Value[0];
    }		
    else
    {
      LOG_INFO_APP("Unknown Attribute handle\n");
    }    
  }
  else
  {
    LOG_INFO_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE, failed handle not found in connection table !\n");
  }
/* USER CODE END gatt_parse_notification_1 */

  return;
}

static void client_discover_all(void)
{
  uint8_t index = 0;
  /* USER CODE BEGIN client_discover_1 */

  /* USER CODE END client_discover_1 */

