stm32-hotspot/STM32WBA-BLE-ANCS-AMS/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_ANCS_AMS_HeartRate/STM32_WPAN/App/gatt_client_app.c
  GATT_CLIENT_APP_Discover_services(index);

  /* USER CODE BEGIN client_discover_2 */
  /* Read value of Time and battery level */
  init_state = CLIENT_READ_TIME;
  tBleStatus result = aci_gatt_read_char_value( a_ClientContext[index].connHdl,
                      a_ClientContext[index].CurrentTimeCharValueHdle);
  
  if (result == BLE_STATUS_SUCCESS)
  {
    gatt_cmd_resp_wait();
  }
  else
  {
    LOG_INFO_APP("Read Curent Time cmd NOK status =0x%02X \n\n", result);
  }
      
  init_state = CLIENT_READ_BATTERY_LEVEL;
  result = aci_gatt_read_char_value( a_ClientContext[index].connHdl,
                      a_ClientContext[index].BatteryLevelCharValueHdle);
  
  if (result == BLE_STATUS_SUCCESS)
  {
    gatt_cmd_resp_wait();
  }
  else
  {
    LOG_INFO_APP("Read Battery Level cmd NOK status =0x%02X \n\n", result);
  }
  
  send_cmd_to_ams(AMS_START_NOTIF, NULL, NULL, NULL);
  /* Set a timer to start the notification of both ANCS and AMS in 500 ms */
  UTIL_TIMER_Start(&Start_Notification_Id);

  /* USER CODE END client_discover_2 */
  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */

static void send_cmd_to_ams(GattCmdToAMS_t GattCmdToAMS, uint16_t char_UUID, uint8_t l_payload, uint8_t *p_Payload)
{
  gatt_client_interface_ams.GattCmdToAMS = GattCmdToAMS;
  gatt_client_interface_ams.char_UUID = char_UUID;  
  gatt_client_interface_ams.l_payload = l_payload;
  memcpy(gatt_client_interface_ams.p_Payload, p_Payload, l_payload);
  UTIL_SEQ_SetTask(1U << CFG_TASK_GATT_CLIENT_TO_AMS_ID, CFG_SEQ_PRIO_0);
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_GATT_CMD_TO_AMS_COMPLETE);  
  return;
};

static void send_cmd_to_ancs(GattCmdToANCS_t GattCmdToANCS, uint16_t char_UUID, uint8_t l_payload, uint8_t *p_Payload)
{
  gatt_client_interface_ancs.GattCmdToANCS = GattCmdToANCS;
  gatt_client_interface_ancs.char_UUID = char_UUID;  
  gatt_client_interface_ancs.l_payload = l_payload;
  memset(gatt_client_interface_ancs.p_Payload, 0, MAX_DATA_LENGTH_TO_ANCS * sizeof(uint8_t));
  memcpy(gatt_client_interface_ancs.p_Payload, p_Payload, l_payload);
  UTIL_SEQ_SetTask(1U << CFG_TASK_GATT_CLIENT_TO_ANCS_ID, CFG_SEQ_PRIO_0);
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_GATT_CMD_TO_ANCS_COMPLETE);  
  return;
};

static void ClientTimer_cb(void *arg)
{
  UTIL_SEQ_SetTask( 1<<CFG_TASK_CLIENT_TIMER_ID, CFG_SEQ_PRIO_0);
}

static void ClientTimer_Task(void)
{
  uint8_t index = 0;
  if (counter_to_1_min++ >= 60 * 1000/REFRESH_SCREEN_TIMER)
  {
    init_state = CLIENT_READ_TIME;
    tBleStatus result = aci_gatt_read_char_value( a_ClientContext[index].connHdl,
                        a_ClientContext[index].CurrentTimeCharValueHdle);
    
    if (result == BLE_STATUS_SUCCESS)
    {
      gatt_cmd_resp_wait();
    }
    else
    {
      LOG_INFO_APP("Read Curent Time cmd NOK status =0x%02X \n\n", result);
    }
  }
  
  ams_update_singer_song_name();
  ancs_update_notif(ShowWithoutModif);
  hrs_update();
  UTIL_SEQ_SetTask( 1U << CFG_TASK_MENU_PRINT_ID, CFG_SEQ_PRIO_0);  //Update Menu
}

static void start_notification(void *arg)
{
  ANCS_init_data.app_init = true;
}

/* USER CODE END LF */
